In [1]:
import pandas as pd

cast=pd.read_csv('cast.csv')

cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [14]:
print('1. ',cast['title'].value_counts()['Hamlet'])

1.  299
1.  187

In [32]:
print('2. ')
cast[cast['title'].str.contains('Treasure Island')].sort_values(by=['year'])

2.

,title,year,name,type,character,n
2454056,Treasure Island,1918,Virginia Lee Corbin,actress,Louise Trelawney,2.0
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
1801138,Treasure Island,1918,Lewis Sargent,actor,Ben Gunn,5.0
313097,Treasure Island,1918,Francis Carpenter,actor,Jim Hawkins,1.0
842286,Treasure Island,1918,Edwin Harley,actor,Prologue Player,NaN
...,...,...,...,...,...,...
2454768,National Theatre Live: Treasure Island,2015,Claire-Louise Cordwell,actress,Joan the Goat,NaN
2194697,National Theatre Live: Treasure Island,2015,Roger (XIII) Wilson,actor,Shanty Singer,NaN
1558129,National Theatre Live: Treasure Island,2015,Alastair Parker,actor,Killigrew the Kind,NaN
2530199,National Theatre Live: Treasure Island,2015,Heather Dutton,actress,Red Ruth,NaN
414026,National Theatre Live: Treasure Island,2015,Daniel Coonan,actor,Black Dog,NaN

In [61]:
print('3. ')
cast[(cast['title'].str.contains('Hamlet')) & (cast.year==1921)]

3.

          title  year                    name     type         character    n
6710     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
408456   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
495468   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1015046  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
1948795  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2116906  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2370048  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2713980  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
2964897  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [82]:
print('4. ')
ca4=cast[(cast['title'].str.contains('Hamlet'))]
ca4['year']=ca4['year']-(ca4['year']%10)
ca4.groupby(['title','year'])['title'].count()

4.

<ipython-input-82-9aee53928f6a>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ca1['year']=ca1['year']-(ca1['year']%10)

title                                    year
A Sagebrush Hamlet                       1910    10
Dogg's Hamlet, Cahoot's Macbeth          2000    39
Fuck Hamlet                              1990     2
Green Eggs and Hamlet                    1990    11
Hamlet                                   1910    28
                                         1920     9
                                         1940    25
                                         1950     1
                                         1960    57
                                         1970    19
                                         1980     3
                                         1990    84
                                         2000    55
                                         2010    18
Hamlet (II)                              1960    21
                                         2000    36
                                         2010    11
Hamlet (III)                             2000     2
                                         2010    15
Hamlet 2                                 2000    52
Hamlet A.D.D.                            2010    66
Hamlet Unbound                           2010     1
Hamlet X                                 2000     1
Hamlet in the Hamptons                   2000    18
Hamlet liikemaailmassa                   1980    14
Hamlet the Vampire Slayer                2000    11
Hamlet's Ghost                           2010    61
Hamlet, Prince of Denmark                1990    12
Hamlet, Son of a Kingpin                 2010    17
Hamlet: Prince of Denmark                1980     1
Hamlet_X                                 2000    58
Han, hun og Hamlet                       1920     9
                                         1930    17
Harry, Hamlet and I                      2010    11
Kadin Hamlet                             1970     4
Kitchen Hamlet                           2000    17
National Theatre Live: Hamlet            2010    23
Predstava 'Hamleta' u Mrdusi Donjoj      1970    14
The Tragedy of Hamlet Prince of Denmark  2000     5
Zombie Hamlet                            2010    33
Name: title, dtype: int64

In [85]:
print('5. ')
ca5=cast[(cast.n==1) & (cast.year==1950)]
ca5.groupby(['n','type'])['n'].count()

5.

n    type
1.0  actor      604
     actress    271
Name: n, dtype: int64

In [147]:
print('6. ')
ca6=cast[(cast.n==1) & (cast.year>=1990)]
ca6=ca6.groupby(['name'])['n']
ca6=ca6.count().nlargest(10)
ca6

6.

name
Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Amitabh Bachchan       68
Eric Roberts           68
Nagarjuna Akkineni     60
Dilip                  59
Name: n, dtype: int64

In [187]:
print('7. ')
ca7=cast[(cast['name'].str.contains('Frank')) & (cast.n==1)]
ca7=ca7.groupby(['year','title','name'], sort = True)['n']
ca7=ca7.count().nlargest(10)
ca7

7.

year  title                      name
1916  A Stranger from Somewhere  Franklyn Farnum      2
1917  The Winged Mystery         Franklyn Farnum      2
1918  The Curse of Iku           Frank Borzage        2
      The Rough Lover            Franklyn Farnum      2
1919  Brothers Divided           Frank Keenan         2
      The Midnight Stage         Frank Keenan         2
1922  Smiling Jim                Franklyn Farnum      2
1927  My Friend from India       Franklin Pangborn    2
1929  Tarzan the Tiger           Frank Merrill        2
1938  Double or Quits            Frank Fox            2
Name: n, dtype: int64